essays/vim/8.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Vim: Buffers, Windows and Tabs</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Anurag Peshne" />
<link rel="stylesheet" type="text/css" href="../../css/style.css" />
<link href='https://fonts.googleapis.com/css?family=Lato' rel='stylesheet' type='text/css'>
<link rel="canonical" href="https://anuragpeshne.github.io/essays/vim/8.html" />
</head>
<body>
<div id="content">
<h1 class="title">Vim: Buffers, Windows and Tabs</h1>
<script> (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){(i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o), m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)})(window,document,'script','//www.google-analytics.com/analytics.js','ga'); ga('create', 'UA-67524931-1', 'auto'); ga('send', 'pageview'); </script>

<p>
This is part 8 of a series of tutorial to Vim. You can read <a href="./7.html">Part 7 here</a>.
</p>

<div id="outline-container-org698be2a" class="outline-2">
<h2 id="org698be2a">One Elephant and Many Men</h2>
<div class="outline-text-2" id="text-org698be2a">
</div><div id="outline-container-org130be8b" class="outline-3">
<h3 id="org130be8b">Buffer</h3>
<div class="outline-text-3" id="text-org130be8b">
<p>
A <b>buffer</b> is just a file loaded up in Vim. You can open multiple files simultaneously
in Vim, either by passing multiple file path as arguments to Vim, if you launch
it from command line, or using <code>:e</code> (or <code>:edit</code>) for editing or <code>:view</code> to view
the file (readonly mode).
</p>

<p>
You can list the open buffers using <code>:ls</code> or <code>:buffers</code>. You can cycle through
the buffers using <code>:bn</code> (<code>:bnext</code> (buffer next)) and <code>:bp</code> (<code>:bN</code>, <code>bprevious</code>
(buffer previous)). Or you can jump to specific buffer using <code>:b</code> followed by
file path (you can type in initial characters and press <code>&lt;tab&gt;</code> for autocomplete).
You can also jump to specific buffer using its ID<sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup>, ID is listed in output of <code>:ls</code>,
using <code>:b</code> followed by ID.
</p>
</div>

<div id="outline-container-orgd2eda79" class="outline-4">
<h4 id="orgd2eda79">Buffer Philosophy</h4>
<div class="outline-text-4" id="text-orgd2eda79">
<p>
Vim uses buffers the way we are used to have multiple things open in Tabs, like
in Internet Browsers. Newer text editors and IDEs have taken this approach,
each file opens in a new tab. I would recommend to use buffers in Vim for this<sup><a id="fnr.2" class="footref" href="#fn.2">2</a></sup>.
</p>
</div>
</div>
</div>

<div id="outline-container-org9b15e8c" class="outline-3">
<h3 id="org9b15e8c">Windows</h3>
<div class="outline-text-3" id="text-org9b15e8c">
<p>
Before we jump to windows, let me remind you of the story of <a href="https://en.wikipedia.org/wiki/Blind_men_and_an_elephant">Elephant and blind men</a>:
There were 7 blind men, who had never encountered elephant before and tried to learn
about it by touching it. The elephant, as we know, is huge and the men could only
feel a small part of the elephant. They drew conclusion about it, poles apart, depending
on the part which they touched.
</p>

<p>
The elephant represents the <i>buffer</i>-a huge body of matter. <i>Windows</i> show a part
of the buffer, just like the way blind men experienced the same elephant. Windows can
show different buffers or same buffer. They are just perspectives.
</p>

<p>
It is also useful to have multiple views of same file side by side to refer some
code which is not visible in current window. For example, I'm using one window to
write the main content and other to write the summary by looking at the same file.
</p>

<p>
Keys:
</p>
<ul class="org-ul">
<li>You can split current window horizontally using <code>&lt;c-w&gt; s</code>, <code>s</code> here stands for <i>split</i>.
<ul class="org-ul">
<li>Every command concerning windows will start with <code>&lt;c-w&gt;</code></li>
</ul></li>
<li>Similarly <code>&lt;c-w&gt; v</code> will make a <i>vertical</i> split.</li>
<li><code>&lt;c-w&gt; &lt;c-w&gt;</code> will toggle focus among windows.</li>
<li><code>&lt;c-w&gt;</code> followed by arrow keys will get focus to the direction of arrow key pressed.</li>
<li><code>&lt;c-w&gt; q</code> will close or <i>quit</i> the window currently in focus.</li>
</ul>
</div>

<div id="outline-container-org5b378ac" class="outline-4">
<h4 id="org5b378ac">A side note: 80 Column Rule</h4>
<div class="outline-text-4" id="text-org5b378ac">
<p>
For those who have never heard of 80 column rule, the rule says that no line
should be longer than 80 characters, and that includes indentation space. In
modern times, the rationale<sup><a id="fnr.3" class="footref" href="#fn.3">3</a></sup> behind the rule is, it is difficult to read
long lines<sup><a id="fnr.4" class="footref" href="#fn.4">4</a></sup>.
</p>

<p>
Having vertical split makes even more sense in light of this rule and wide monitors.
Instead of having one monolithic fat file opened, it is better to have multiple
windows (perspective) displaying different files or different part of same file.
</p>
</div>
</div>
</div>

<div id="outline-container-orga4c1884" class="outline-3">
<h3 id="orga4c1884">Tabs</h3>
<div class="outline-text-3" id="text-orga4c1884">
<p>
Vim also has <i>tabs</i> but these tabs are different from the tabs which you might
be familiar with. In Vim, you can think of tabs as arrangement of windows, instead
of representing open files. Thus, in one arrangement, you can have 4 splits&#x2013;2 vertical
, 2 horizontal&#x2013;and just 2 splits in other. These windows may or may not show
same files. The main idea behind this is to save the configuration of splits.
Thus, you might have a tab which is optimized for developing code and other
designed for debugging.
</p>

<p>
Keys:
</p>
<ul class="org-ul">
<li><code>:tabnew</code> to create new tab</li>
<li><code>:tabn</code> or <code>gt</code> to goto next tab</li>
<li><code>:tabp</code> or <code>gT</code> to goto previous tab</li>
</ul>
</div>
</div>

<div id="outline-container-org550d7c7" class="outline-3">
<h3 id="org550d7c7">Lesson 9</h3>
<div class="outline-text-3" id="text-org550d7c7">
<p class="verse">
A buffer is the in-memory text of a file.<br />
A window is a viewport on a buffer.<br />
A tab page is a collection of windows<br />
</p>
<ul class="org-ul">
<li>This summary is taken directly from Vim's documentation.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org3f569b9" class="outline-2">
<h2 id="org3f569b9">One more thing: Help!</h2>
<div class="outline-text-2" id="text-org3f569b9">
<p>
You now have seen a lot of commands and terms of Vim. Keeping up with so many things
, even for a seasoned Vim user, can be tough. Fortunately, Vim has a very helpful
, inbuilt and easy to use documentation. And, it is available offline too!
</p>

<p>
The way to summon Vim's documentation system is by hitting <code>:help</code> followed by
command or concept. For example, you can read more about <i>buffer</i> switching
by typing <code>:help :bn</code> or more about <i>window</i> using <code>:help window</code>. Vim will
open up another window showing a buffer of Vim's documentation.
</p>

<p>
Try it! it is really that simple.
</p>
</div>
</div>

<div id="outline-container-org98e45fb" class="outline-2">
<h2 id="org98e45fb">Summary</h2>
<div class="outline-text-2" id="text-org98e45fb">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Command</th>
<th scope="col" class="org-left">Comment</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>:e</code> or <code>:edit</code></td>
<td class="org-left">open file for edit</td>
</tr>

<tr>
<td class="org-left"><code>:view</code></td>
<td class="org-left">open file for view (read only)</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left"><code>:ls</code> or <code>:buffers</code></td>
<td class="org-left">list loaded buffers</td>
</tr>

<tr>
<td class="org-left"><code>:bn</code> or <code>:bnext</code></td>
<td class="org-left">switch to <i>next</i> buffer</td>
</tr>

<tr>
<td class="org-left"><code>:bp</code> or <code>:bprevious</code></td>
<td class="org-left">switch to <i>previous</i> buffer</td>
</tr>

<tr>
<td class="org-left"><code>:b&lt;id&gt;</code></td>
<td class="org-left">switch to <code>id</code> buffer</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left"><code>&lt;c-w&gt; s</code></td>
<td class="org-left">horizontal <i>split</i></td>
</tr>

<tr>
<td class="org-left"><code>&lt;c-w&gt; v</code></td>
<td class="org-left"><i>vertical</i> split</td>
</tr>

<tr>
<td class="org-left"><code>&lt;c-w&gt; &lt;c-w&gt;</code></td>
<td class="org-left">cycle focus through window</td>
</tr>

<tr>
<td class="org-left"><code>&lt;c-w&gt; &lt;arrow keys&gt;</code></td>
<td class="org-left">shift focus to window in direction of arrow key</td>
</tr>

<tr>
<td class="org-left"><code>&lt;c-w&gt; q</code></td>
<td class="org-left"><i>quit</i> window</td>
</tr>

<tr>
<td class="org-left"><code>&lt;c-w&gt; =</code></td>
<td class="org-left">make each split of same size</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left"><code>:tabnew</code></td>
<td class="org-left">create <i>new</i> tab</td>
</tr>

<tr>
<td class="org-left"><code>:tabn</code> or <code>gt</code></td>
<td class="org-left">cycle through tabs (tab <i>next</i>)</td>
</tr>

<tr>
<td class="org-left"><code>:tabp</code> or <code>gT</code></td>
<td class="org-left">cycle through tabs backwards (tab <i>previous</i>)</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left"><code>:help &lt;command/term&gt;</code></td>
<td class="org-left">searches for <code>&lt;command/term&gt;</code> in Vim's documentation</td>
</tr>
</tbody>
</table>

<p>
<a href="./9.html">Click here for part 9</a>
</p>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1">1</a></sup> <div class="footpara"><p class="footpara">
Vim Documentation calls this ID as <i>unique number</i> which will never change.
</p></div></div>

<div class="footdef"><sup><a id="fn.2" class="footnum" href="#fnr.2">2</a></sup> <div class="footpara"><p class="footpara">
In <a href="./3.html">Part 3</a>, we talked about <code>gf</code> (goto file) which opens file, ie opens a new buffer. You can go back to previous buffer using <code>:bp</code>
</p></div></div>

<div class="footdef"><sup><a id="fn.3" class="footnum" href="#fnr.3">3</a></sup> <div class="footpara"><p class="footpara">
If you <a href="https://duckduckgo.com/?q=80+column+rule+reason&amp;t=ffab&amp;ia=qa">search around</a> you'll find plenty of discussion about this.
</p></div></div>

<div class="footdef"><sup><a id="fn.4" class="footnum" href="#fnr.4">4</a></sup> <div class="footpara"><p class="footpara">
<a href="https://en.wikipedia.org/wiki/Column_(typography)">Wiki: Column</a>
</p></div></div>


</div>
</div><div id="disqus_thread"></div>
<script>
    var disqus_config = function () {
this.page.url = "https://anuragpeshne.github.io/essays/vim/8.html";
this.page.identifier = "/essays/vim/8.html";
};
    (function() {  // DON'T EDIT BELOW THIS LINE
        var d = document, s = d.createElement('script');

        s.src = '//anuragpeshne.disqus.com/embed.js';

        s.setAttribute('data-timestamp', +new Date());
        (d.head || d.body).appendChild(s);
    })();
</script>
<noscript>Please enable JavaScript to view the <a href="https://disqus.com/?ref_noscript" rel="nofollow">comments powered by Disqus.</a></noscript></div>
<div id="postamble" class="status">
<p class="date">Date: 2017-06-12</p>
<p class="author">Author: Anurag Peshne</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.1.1 (<a href="http://orgmode.org">Org</a> mode 9.0.8)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
